lxc_benchmark_results.txt
Starting cpu test!
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Prime numbers limit: 20000

Initializing worker threads...

Threads started!

CPU speed:
    events per second:   279.05

General statistics:
    total time:                          10.0034s
    total number of events:              2792

Latency (ms):
         min:                                    3.39
         avg:                                    3.58
         max:                                    7.38
         95th percentile:                        3.89
         sum:                                 9995.30

Threads fairness:
    events (avg/stddev):           2792.0000/0.00
    execution time (avg/stddev):   9.9953/0.00

CPU test complete!
Starting file IO tests!
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

128 files, 400Kb each, 50Mb total
Creating files for the test...
Extra file open flags: (none)
Creating file test_file.0
Creating file test_file.1
Creating file test_file.2
Creating file test_file.3
Creating file test_file.4
Creating file test_file.5
Creating file test_file.6
Creating file test_file.7
Creating file test_file.8
Creating file test_file.9
Creating file test_file.10
Creating file test_file.11
Creating file test_file.12
Creating file test_file.13
Creating file test_file.14
Creating file test_file.15
Creating file test_file.16
Creating file test_file.17
Creating file test_file.18
Creating file test_file.19
Creating file test_file.20
Creating file test_file.21
Creating file test_file.22
Creating file test_file.23
Creating file test_file.24
Creating file test_file.25
Creating file test_file.26
Creating file test_file.27
Creating file test_file.28
Creating file test_file.29
Creating file test_file.30
Creating file test_file.31
Creating file test_file.32
Creating file test_file.33
Creating file test_file.34
Creating file test_file.35
Creating file test_file.36
Creating file test_file.37
Creating file test_file.38
Creating file test_file.39
Creating file test_file.40
Creating file test_file.41
Creating file test_file.42
Creating file test_file.43
Creating file test_file.44
Creating file test_file.45
Creating file test_file.46
Creating file test_file.47
Creating file test_file.48
Creating file test_file.49
Creating file test_file.50
Creating file test_file.51
Creating file test_file.52
Creating file test_file.53
Creating file test_file.54
Creating file test_file.55
Creating file test_file.56
Creating file test_file.57
Creating file test_file.58
Creating file test_file.59
Creating file test_file.60
Creating file test_file.61
Creating file test_file.62
Creating file test_file.63
Creating file test_file.64
Creating file test_file.65
Creating file test_file.66
Creating file test_file.67
Creating file test_file.68
Creating file test_file.69
Creating file test_file.70
Creating file test_file.71
Creating file test_file.72
Creating file test_file.73
Creating file test_file.74
Creating file test_file.75
Creating file test_file.76
Creating file test_file.77
Creating file test_file.78
Creating file test_file.79
Creating file test_file.80
Creating file test_file.81
Creating file test_file.82
Creating file test_file.83
Creating file test_file.84
Creating file test_file.85
Creating file test_file.86
Creating file test_file.87
Creating file test_file.88
Creating file test_file.89
Creating file test_file.90
Creating file test_file.91
Creating file test_file.92
Creating file test_file.93
Creating file test_file.94
Creating file test_file.95
Creating file test_file.96
Creating file test_file.97
Creating file test_file.98
Creating file test_file.99
Creating file test_file.100
Creating file test_file.101
Creating file test_file.102
Creating file test_file.103
Creating file test_file.104
Creating file test_file.105
Creating file test_file.106
Creating file test_file.107
Creating file test_file.108
Creating file test_file.109
Creating file test_file.110
Creating file test_file.111
Creating file test_file.112
Creating file test_file.113
Creating file test_file.114
Creating file test_file.115
Creating file test_file.116
Creating file test_file.117
Creating file test_file.118
Creating file test_file.119
Creating file test_file.120
Creating file test_file.121
Creating file test_file.122
Creating file test_file.123
Creating file test_file.124
Creating file test_file.125
Creating file test_file.126
Creating file test_file.127
52428800 bytes written in 1.07 seconds (46.72 MiB/sec).
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 400KiB each
50MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      774.22
    writes/s:                     516.14
    fsyncs/s:                     1652.07

Throughput:
    read, MiB/s:                  12.10
    written, MiB/s:               8.06

General statistics:
    total time:                          300.0692s
    total number of events:              882810

Latency (ms):
         min:                                    0.00
         avg:                                    0.34
         max:                                  543.66
         95th percentile:                        0.87
         sum:                               297682.72

Threads fairness:
    events (avg/stddev):           882810.0000/0.00
    execution time (avg/stddev):   297.6827/0.00

sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Removing test files...
File IO tests complete!
Starting memory test!
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Running memory speed test with the following options:
  block size: 1KiB
  total size: 102400MiB
  operation: write
  scope: global

Initializing worker threads...

Threads started!

Total operations: 8664590 (866262.05 per second)

8461.51 MiB transferred (845.96 MiB/sec)


General statistics:
    total time:                          10.0002s
    total number of events:              8664590

Latency (ms):
         min:                                    0.00
         avg:                                    0.00
         max:                                   14.69
         95th percentile:                        0.00
         sum:                                13916.63

Threads fairness:
    events (avg/stddev):           2166147.5000/48031.92
    execution time (avg/stddev):   3.4792/0.03

Starting memory test complete!
Starting threads test!
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Initializing worker threads...

Threads started!


General statistics:
    total time:                          20.0006s
    total number of events:              16974

Latency (ms):
         min:                                    1.08
         avg:                                    1.18
         max:                                   17.23
         95th percentile:                        1.32
         sum:                                19960.02

Threads fairness:
    events (avg/stddev):           16974.0000/0.00
    execution time (avg/stddev):   19.9600/0.00

Threads test complete!